Revit 2027 API
GeometryCreationUtilities.CreateRevolvedGeometry Method
Overload List
Name | Description
CreateRevolvedGeometry(Frame, IList<CurveLoop>, Double, Double) |  Creates a solid of revolution by revolving a set of closed curve loops around an axis by a specified angle.
CreateRevolvedGeometry(Frame, IList<CurveLoop>, Double, Double, SolidOptions) |  Creates a solid of revolution by revolving a set of closed curve loops around an axis by a specified angle.
Top
See Also
Reference
GeometryCreationUtilities Class
Autodesk.Revit.DB Namespace